gen_text_list = [
    {
        'host': 'JackyChen', 
        'context': [
            {'title': 'encourage_betting_01', 'text': '等等誰先衝起來，這局節奏會很有看頭。'},
            {'title': 'encourage_betting_02', 'text': '桌上莊門籌碼比較多，要不要再跟就看您了。'},
            {'title': 'encourage_betting_03', 'text': '壓莊的老闆現在位置相當舒服。'},
            {'title': 'encourage_betting_04', 'text': '莊家天牌起手，這局莊門優勢超級明顯，要守要衝就看各位老闆心情。'},
            {'title': 'encourage_betting_05', 'text': '閒家先站中段優勢，莊門氣勢偏弱，壓閒的朋友這局可以好好看戲。'},
            {'title': 'encourage_betting_06', 'text': '中分對中分，誰也不讓誰，這種拉鋸局，老闆們要拚要休都很合理。'},
            {'title': 'encourage_betting_07', 'text': '莊家優勢明顯，但閒家長龍氣勢如虹，第三張牌將決定勝負！翻盤的關鍵時刻，快來下注，贏家就是你！'},
            {'title': 'encourage_betting_08', 'text': '關鍵時刻！閒家能否打破莊家的巨大優勢，延續閒長龍的奇蹟？下注的時刻到了，讓我們拭目以待！'},
            {'title': 'encourage_betting_09', 'text': '莊家目前以巨大領先，但閒家有長龍加持，會不會逆轉勝呢？各位賭客，這是下注的關鍵時刻，快來押注吧！'},
            {'title': 'encourage_betting_10', 'text': '莊家巨幅領先，閒家能否打破長龍奇蹟翻盤？下注時刻，機會就在眼前，讓我們拭目以待！'},
            {'title': 'encourage_betting_11', 'text': '目前牌局緊張刺激！莊家壓住金額領先，究竟誰能逆轉勝局？快來下注，見證奇蹟時刻！'},
            {'title': 'encourage_betting_12', 'text': '目前莊閒平手，各自補牌決勝負！閒家長龍能否延續？誰能笑到最後？下注時刻，機會就在眼前！'},
        ]
     },
    {
        'host': 'Trump', 
        'context': [
            # {'title': 'encourage_betting_01', 'text': '等等誰先衝起來，這局節奏會很有看頭。'},
            # {'title': 'encourage_betting_02', 'text': '桌上莊門籌碼比較多，要不要再跟就看您了。'},
            # {'title': 'encourage_betting_03', 'text': '壓莊的老闆現在位置相當舒服。'},
            # {'title': 'encourage_betting_04', 'text': '莊家天牌起手，這局莊門優勢超級明顯，要守要衝就看各位老闆心情。'},
            # {'title': 'encourage_betting_05', 'text': '閒家先站中段優勢，莊門氣勢偏弱，壓閒的朋友這局可以好好看戲。'},
            # {'title': 'encourage_betting_06', 'text': '中分對中分，誰也不讓誰，這種拉鋸局，老闆們要拚要休都很合理。'},
            # {'title': 'encourage_betting_07', 'text': '莊家優勢明顯，但閒家長龍氣勢如虹，第三張牌將決定勝負！翻盤的關鍵時刻，快來下注，贏家就是你！'},
            # {'title': 'encourage_betting_08', 'text': '關鍵時刻！閒家能否打破莊家的巨大優勢，延續閒長龍的奇蹟？下注的時刻到了，讓我們拭目以待！'},
            # {'title': 'encourage_betting_09', 'text': '莊家目前以巨大領先，但閒家有長龍加持，會不會逆轉勝呢？各位賭客，這是下注的關鍵時刻，快來押注吧！'},
            # {'title': 'encourage_betting_10', 'text': '莊家巨幅領先，閒家能否打破長龍奇蹟翻盤？下注時刻，機會就在眼前，讓我們拭目以待！'},
            # {'title': 'encourage_betting_11', 'text': '目前牌局緊張刺激！莊家壓住金額領先，究竟誰能逆轉勝局？快來下注，見證奇蹟時刻！'},
            # {'title': 'encourage_betting_12', 'text': '目前莊閒平手，各自補牌決勝負！閒家長龍能否延續？誰能笑到最後？下注時刻，機會就在眼前！'},
            
            {'title': 'bet01_01', 'text': '單跳節奏明確，前局閒，依照規律這手輪到莊方更有機會。'},
            {'title': 'bet01_02', 'text': '庄連勝氣勢強，跟上這波龍脈，別錯過機會。'},
            {'title': 'bet01_03', 'text': '閒勢連開不斷，龍頭正熱，跟上這波就對了。'},
            {'title': 'bet01_04', 'text': '庄閒閒交錯，一房兩廳規律明顯，押莊最穩。'},
            
            {'title': 'bet02_01', 'text': '莊家再亮天牌，閒門壓力不小，敢玩反向單跳 前一場是莊贏的老闆應該很喜歡這種畫面。'},
            {'title': 'bet02_02', 'text': '閒天牌莊低分，庄長龍有時也會被這樣敲一下，莊門老闆穩住就好，下局再想反攻。'},
            {'title': 'bet02_03', 'text': '雙高分搭閒長龍，閒門錢多氣勢也強，莊家玩家如果進場就真的是為爽度。'},
            {'title': 'bet02_04', 'text': '閒高莊低、閒押領先、路也偏閒，是蠻標準的順風局。'},
            
            {'title': 'bet03_01', 'text': '閒長龍來勢洶洶，莊家要補牌翻盤，大家把握機會，快下注，刺激的瞬間即將到來！'},
            {'title': 'bet03_02', 'text': '莊閒雙方不相上下，補牌決勝負，莊長龍氣勢如虹，跟著壓住庄家不會錯！快下注，抓住機會！'},
            {'title': 'bet03_03', 'text': '閒家7點，強勢如虹！現在是庄家補牌翻盤的機會，賭注刺激，誰能旗開得勝？加碼閒家，還是相信庄家逆轉？勇者勝！'},
            {'title': 'bet03_04', 'text': '各位注意！閒家即將補牌，逆轉大局的機會來了！押注在閒家的朋友們，這是你們贏錢的好時機！快狠準！'},
            
            {'title': 'bet04_01', 'text': '目前牌局緊張刺激！莊家壓住金額領先，究竟誰能逆轉勝局？快來下注，見證奇蹟時刻！'},
            {'title': 'bet04_02', 'text': '閒家拿下8點，似乎勝券在握，但庄家補牌還有機會翻盤，繼續押庄家，長龍可能延續！'},
            {'title': 'bet04_03', 'text': '各位玩家，現在莊家只有微弱點數，補牌後可能逆轉局勢！上一場閒家勝利，這次您要支持莊家翻盤嗎？抓住機會加注吧！'},
            {'title': 'bet04_04', 'text': '閒家補牌完美9點，莊家點數弱勢，接下來的補牌至關重要！壓莊的賭客們，是時候翻盤了！快下注，感受贏家的魅力！'},
        ]
     },
]